upper_BCs_type/Blasius_baseCase2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          125;
        startFace       17305;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       17430;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       17500;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       17570;
    }
    symmBound
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       17670;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17500;
        startFace       17695;
    }
)

// ************************************************************************* //
